Revit 2027 API
BuiltInFailures.GeometryFailures.LineArcTangentFailure Property
 Can't keep arc element and straight line element tangent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LineArcTangentFailure { get; }
Public Shared ReadOnly Property LineArcTangentFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LineArcTangentFailure {
	FailureDefinitionId^ get ();
}
static member LineArcTangentFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace